export interface 基本面操作_inter {
  msg: string;
  /**
  個股綜合損益表
  * @param stockid 個股代號
  * @param Yseason 年度季別，例如：20154
  * @returns JSON
  */
  GETTaiwanStockFinancialStatements(
    stockid: string,
    Yseason: string
  ): Promise<個股綜合損益表>;
  /**
  個股現金流量表
  * @param stockid 個股代號
  * @param Yseason 年度季別，例如：20154
  * @returns JSON
  */
  GETTaiwanCashFlowsStatement(
    stockid: string,
    Yseason: string
  ): Promise<個股現金流量表>;
  /**
  獲取個股資產負債表
  * @param stockid 個股代號
  * @param Yseason 年度季別，例如：20154
  * @returns JSON
  */
  GETTaiwanStockBalanceSheet(
    stockid: string,
    Yseason: string
  ): Promise<個股資產負債表>;
  /**
   * 獲取營業收入
   * @param stockid
   * @param Yseason
   * @returns
   */
  GETTaiwanRevenue(stockid: string, Yseason: string): Promise<GraphData>;
  /**
   * 個股股本
   * @param stockid
   * @param Yseason
   */
  GETTaiwanCommonStock(stockid: string, Yseason: string): Promise<GraphData>;
  /**
   * 個股年營業收入年增率
   * @param stockid
   * @param Yseason
   */
  GETTaiwanStockYearRevenue(
    stockid: string,
    Yseason: string
  ): Promise<GraphData>;
  /**
   * 獲取個股殖利率，本益比，股價淨值比。
   * @param date
   * @returns
   */
  GETAllTaiwanStockYield(date: string): Promise<EarnRatio[]>;
}
/*
  基本面功能:
  三大報表：
  * 資產負債表 GETTaiwanStockBalanceSheet
  * 綜合損益表 TaiwanStockFinancialStatements
  * 現金流量表 TaiwanCashFlowsStatement

  綜合損益趨勢：
  * 營業收入
    營業毛利
    稅後純益
    每股盈餘

  其他表：
  * 殖利率
    股利政策表 TaiwanStockDividend
    除權除息結果表 TaiwanStockDividendResult
    月營收表 TaiwanStockMonthRevenue
    減資恢復買賣參考價格 TaiwanStockCapitalReductionReferencePrice
*/

//#region  三大報表

export class 個股資產負債表 {
  '現金及約當現金' = '';
  '透過損益按公允價值衡量之金融資產－流動' = '';
  '透過其他綜合損益按公允價值衡量之金融資產－流動' = '';
  '按攤銷後成本衡量之金融資產－流動' = '';
  '避險之金融資產－流動' = '';
  '應收帳款淨額' = '';
  '應收帳款－關係人淨額' = '';
  '其他應收款－關係人淨額' = '';
  '存貨' = '';
  '其他流動資產' = '';
  '流動資產合計' = '';
  '透過其他綜合損益按公允價值衡量之金融資產－非流動' = '';
  '按攤銷後成本衡量之金融資產－非流動' = '';
  '採用權益法之投資' = '';
  '不動產、廠房及設備' = '';
  '使用權資產' = '';
  '無形資產' = '';
  '遞延所得稅資產' = '';
  '其他非流動資產' = '';
  '非流動資產合計' = '';
  '資產總額' = '';
  '短期借款' = '';
  '應付短期票券' = '';
  '透過損益按公允價值衡量之金融負債－流動' = '';
  '避險之金融負債－流動' = '';
  '應付帳款' = '';
  '應付帳款－關係人' = '';
  '其他應付款' = '';
  '本期所得稅負債' = '';
  '其他流動負債' = '';
  '流動負債合計' = '';
  '應付公司債' = '';
  '遞延所得稅負債' = '';
  '租賃負債－非流動' = '';
  '其他非流動負債' = '';
  '非流動負債合計' = '';
  '負債總額' = '';
  '普通股股本' = '';
  '股本合計' = '';
  '資本公積－發行溢價' = '';
  '資本公積-認列對子公司所有權權益變動數' = '';
  '資本公積－受贈資產' = '';
  '資本公積－採用權益法認列關聯企業及合資股權淨值之變動數' = '';
  '資本公積－合併溢額' = '';
  '資本公積合計' = '';
  '法定盈餘公積' = '';
  '特別盈餘公積' = '';
  '未分配盈餘（或待彌補虧損）' = '';
  '保留盈餘合計' = '';
  '其他權益合計' = '';
  '歸屬於母公司業主之權益合計' = '';
  '非控制權益' = '';
  '權益總額' = '';
  '負債及權益總計' = '';
  '預收股款（權益項下）之約當發行股數（單位：股）' = '';
  '母公司暨子公司所持有之母公司庫藏股股數（單位：股）' = '';
}
export class 個股現金流量表 {
  '繼續營業單位稅前淨利（淨損）' = '';
  '本期稅前淨利（淨損）' = '';
  '折舊費用' = '';
  '攤銷費用' = '';
  '預期信用減損損失（利益）數∕呆帳費用提列（轉列收入）數' = '';
  '利息費用' = '';
  '利息收入' = '';
  '股利收入' = '';
  '股份基礎給付酬勞成本' = '';
  '採用權益法認列之關聯企業及合資損失（利益）之份額' = '';
  '處分及報廢不動產、廠房及設備損失（利益）' = '';
  '處分投資損失（利益）' = '';
  '非金融資產減損損失' = '';
  '未實現外幣兌換損失（利益）' = '';
  '其他項目' = '';
  '收益費損項目合計' = '';
  '強制透過損益按公允價值衡量之金融資產（增加）減少' = '';
  '應收帳款（增加）減少' = '';
  '應收帳款－關係人（增加）減少' = '';
  '其他應收款－關係人（增加）減少' = '';
  '存貨減少(增加)之調整數' = '';
  '其他流動資產（增加）減少' = '';
  '其他金融資產（增加）減少' = '';
  '與營業活動相關之資產之淨變動合計' = '';
  '應付帳款增加（減少）' = '';
  '應付帳款－關係人增加（減少）' = '';
  '其他流動負債增加（減少）' = '';
  '淨確定福利負債增加(減少)' = '';
  '其他營業負債增加（減少）' = '';
  '與營業活動相關之負債之淨變動合計' = '';
  '與營業活動相關之資產及負債之淨變動合計' = '';
  '調整項目合計' = '';
  '營運產生之現金流入（流出）' = '';
  '退還（支付）之所得稅' = '';
  '營業活動之淨現金流入（流出）' = '';
  '取得透過其他綜合損益按公允價值衡量之金融資產' = '';
  '處分透過其他綜合損益按公允價值衡量之金融資產' = '';
  '透過其他綜合損益按公允價值衡量之金融資產減資退回股款' = '';
  '取得按攤銷後成本衡量之金融資產' = '';
  '除列避險之金融負債' = '';
  '取得不動產、廠房及設備' = '';
  '處分不動產、廠房及設備' = '';
  '存出保證金增加' = '';
  '存出保證金減少' = '';
  '取得無形資產' = '';
  '其他預付款項增加' = '';
  '收取之利息' = '';
  '收取之股利' = '';
  '其他投資活動' = '';
  '投資活動之淨現金流入（流出）' = '';
  '短期借款增加' = '';
  '發行公司債' = '';
  '償還公司債' = '';
  '舉借長期借款' = '';
  '存入保證金增加' = '';
  '存入保證金減少' = '';
  '租賃本金償還' = '';
  '發放現金股利' = '';
  '庫藏股票買回成本' = '';
  '處分子公司股權（未喪失控制力）' = '';
  '支付之利息' = '';
  '非控制權益變動' = '';
  '籌資活動之淨現金流入（流出）' = '';
  '匯率變動對現金及約當現金之影響' = '';
  '本期現金及約當現金增加（減少）數' = '';
  '期初現金及約當現金餘額' = '';
  '期末現金及約當現金餘額' = '';
  '資產負債表帳列之現金及約當現金' = '';
}
export class 個股綜合損益表 {
  '營業收入合計': '';
  '營業成本合計': '';
  '營業毛利（毛損）': '';
  '營業毛利（毛損）淨額': '';
  '推銷費用': '';
  '管理費用': '';
  '研究發展費用': '';
  '營業費用合計': '';
  '其他收益及費損淨額': '';
  '營業利益（損失）': '';
  '利息收入': '';
  '其他收入': '';
  '其他利益及損失淨額': '';
  '財務成本淨額': '';
  '採用權益法認列之關聯企業及合資損益之份額淨額': '';
  '營業外收入及支出合計': '';
  '稅前淨利（淨損）': '';
  '所得稅費用（利益）合計': '';
  '繼續營業單位本期淨利（淨損）': '';
  '本期淨利（淨損）': '';
  '透過其他綜合損益按公允價值衡量之權益工具投資未實現評價損益': '';
  '避險工具之損益－不重分類至損益': '';
  '採用權益法認列之關聯企業及合資之其他綜合損益之份額-不重分類至損益之項目': '';
  '與不重分類之項目相關之所得稅': '';
  '不重分類至損益之項目：': '';
  '國外營運機構財務報表換算之兌換差額': '';
  '透過其他綜合損益按公允價值衡量之債務工具投資未實現評價損益': '';
  '避險工具之損益': '';
  '採用權益法認列之關聯企業及合資之其他綜合損益之份額-可能重分類至損益之項目': '';
  '與可能重分類之項目相關之所得稅': '';
  '後續可能重分類至損益之項目：': '';
  '其他綜合損益（淨額）': '';
  '本期綜合損益總額': '';
  '母公司業主（淨利∕損）': '';
  '非控制權益（淨利∕損）': '';
  '母公司業主（綜合損益）': '';
  '非控制權益（綜合損益）': '';
  '基本每股盈餘': '';
  '稀釋每股盈餘': '';
}

export class EarnRatio {
  '證券代號' = '';
  '證券名稱' = '';
  '本益比' = '';
  '殖利率(%)' = '';
  '股價淨值比' = '';
}

export class GraphData {
  xaxisList: string[] = []; //季度別
  ylabel: unknown = null;
  yaxisLabel = '';
  graphData: [
    {
      data: [number, number, string][];
      label: string;
    },
    {
      data: [number, number, string][];
      label: string;
    }
  ] = [
    {data: [], label: ''},
    {data: [], label: ''},
  ]; //個股收入總表,類股平均
  showNameList: string[] = []; //公司名稱
  checkedNameList: string[] = []; //公司名稱, 類股名稱
  extraNameList: string[] = [];
}
